In [1]:
import numpy as np

In [3]:
#Q1 - 5부터 14까지의 1차원 ndarray를 생성하여 다음과 같은 화면이 출력되도록 numpy로 데이터를 핸들링하세요"

#sa = np.array([[5,6,7,8,9,10,11,12,13,14]])
print("<출력화면>")
s = np.arange(start=5, stop=15)
print("Sequence array : ", s)
#af = np.array([[5,6,7,8,9,10,11,12,13,14]], dtype=float)
a = s.astype("float64")
print("array_float : ", a)
print("type : ", a.dtype)
array2 = a.reshape((2,5))
print("array2 : \n", array2)
print("shape : ",array2.shape)

<출력화면>
Sequence array :  [ 5  6  7  8  9 10 11 12 13 14]
array_float :  [ 5.  6.  7.  8.  9. 10. 11. 12. 13. 14.]
type :  float64
array2 :
 [[ 5.  6.  7.  8.  9.]
 [10. 11. 12. 13. 14.]]
shape :  (2, 5)

In [5]:
#Q2 - Q1에서 만든 ndarray를 활용하여 다음의 인덱싱 결과를 출력하세요

array_int = array2.astype('int64')
#np.take(array2, [[2, 3], [7, 8]])
#print(array2[:,2:4])
#array2[array2 > 6]
print('Slicing Indexing Result : \n', array_int[0:2, 2:4])
print('Fancy Indexing Result :\n', array_int[[0,1],2:4])
print('Boolean Indexing Result :\n', s[s>6])

Slicing Indexing Result :
 [[ 7  8]
 [12 13]]
Fancy Indexing Result :
 [[ 7  8]
 [12 13]]
Boolean Indexing Result :
 [ 7  8  9 10 11 12 13 14]

In [7]:
#Q3 - 다음의 각 학생들의 성적을 내림차순으로 정렬을 한 후 각 학생의 이름과 원본 행렬의 인덱스 값을 출력하시오

"""
StudentName = ['John', 'Mike', 'Sarah', 'Kate', 'Samuel']
Score = [78, 95, 84, 98, 88]
#name_score = np.append([StudentName],[Score], axis=0)
name = list(StudentName)
sc = list(Score)
dict1 = {item : name[index] for index, item in enumerate(sc)}
dict1
"""

name_array = np.array(['John', 'Mike', 'Sarah', 'Kate', 'Samuel'])
score_array= np.array([78, 95, 84, 98, 88])
print("Student Name : ", name_array)
print("Score :", score_array)


n=len(score_array)
sort_indices_asc = np.argsort(score_array)
decending_indices = sort_indices_asc[::-1][:n]
print('성적 내림차순으로 name_array의 이름 출력:', name_array[decending_indices])
print('성적 내림차순 정렬 시 score_array의 인덱스:', decending_indices)

Student Name :  ['John' 'Mike' 'Sarah' 'Kate' 'Samuel']
Score : [78 95 84 98 88]
성적 내림차순으로 name_array의 이름 출력: ['Kate' 'Mike' 'Samuel' 'Sarah' 'John']
성적 내림차순 정렬 시 score_array의 인덱스: [3 1 4 2 0]

In [5]:
#new_dict = sorted(dict1)
#new_dict
## ????

[78, 84, 88, 95, 98]

In [9]:
#Q4 - (1) 타이타닉 데이터를 읽어들여 다음의 문제를 완료하시오"

import pandas as pd
data = pd.read_csv('titanic_train.csv')

In [10]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [13]:
#(1) 결손 데이터를 검색하여 Missing 데이터를 처리하고 isna()로 결손 데이터 여부를 출력하시오
data['Cabin'] = data['Cabin'].fillna('C000')
data['Age'] = data['Age'].fillna(data['Age'].mean())
data['Embarked'] = data['Embarked'].fillna('S')
data.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [18]:
#(2) Age_0(Age=0)변수와 Age_by_10(Age*10)변수와 Family (Siblings + Parch+1)변수를 새로 생성하시오
data['Age_0'] = 0
#data.loc[data['Age']!=0,'Age_0'] = 1
data['Age_group'] = (data['Age']//10)*10
data['Age_by10'] = data['Age']*10
data['Family'] = data['SibSp']+data['Parch']+1
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_0,Age_by10,Family,Age_cat,Age_group
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C000,S,0,220.0,2,20,20.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2,30,30.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C000,S,0,260.0,1,20,20.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,350.0,2,30,30.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C000,S,0,350.0,1,30,30.0

In [19]:
#(4) 각 연령대(10대 ~ 60대)별 남녀가 몇명인지 구하시오
def get_category(age):
    cat = ''
    if age < 20: cat = '10'
    elif age < 30: cat = '20'
    elif age < 40: cat = '30'
    elif age < 50: cat = '40'
    elif age < 60: cat = '50'
    elif age < 70: cat = '60'
    elif age < 80: cat = '70'
    else : cat = '80'
    
    return cat

data['Age_cat'] = data['Age'].apply(lambda x : get_category(x))
titanic_groupby = data.groupby(['Age_cat','Sex'])['PassengerId'].count()
titanic_groupby

Age_cat  Sex
10       female     75
         male       89
20       female    125
         male      272
30       female     60
         male      107
40       female     32
         male       57
50       female     18
         male       30
60       female      4
         male       15
70       male        6
80       male        1
Name: PassengerId, dtype: int64

In [20]:
data.drop(columns=['SibSp','Parch']).head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked,Age_0,Age_by10,Family,Age_cat,Age_group
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,C000,S,0,220.0,2,20,20.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C,0,380.0,2,30,30.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,C000,S,0,260.0,1,20,20.0

In [21]:
data.groupby(['Age_group','Sex']).count()["PassengerId"]

Age_group  Sex
0.0        female     30
           male       32
10.0       female     45
           male       57
20.0       female    125
           male      272
30.0       female     60
           male      107
40.0       female     32
           male       57
50.0       female     18
           male       30
60.0       female      4
           male       15
70.0       male        6
80.0       male        1
Name: PassengerId, dtype: int64